name: "creditfraud"
platform: "onnxruntime_onnx"
max_batch_size: 64

input [
    {
        name: "dense_14_input"
        data_type: TYPE_FP32
        dims: [ -1, 29 ]
    }
]
output [
    {
        name: "dense_15"
        data_type: TYPE_FP32
        dims: [ -1, 1 ]
    }
]

dynamic_batching {
  preferred_batch_size: [ 1,2,4,8,16,32,64 ]
  max_queue_delay_microseconds: 500

}

instance_group [ 
    { 
        count: 2
        kind: KIND_CPU 
    }
]

